# GetNestedLinkLoadResults Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkLoadResult..::..GetNestedLinkLoadResults Method
LinkLoadResult Class See Also
---
Gets the results for this link's nested links.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IDictionary<string, LinkLoadResult> GetNestedLinkLoadResults()
```

Visual Basic
---
```text
Public Function GetNestedLinkLoadResults As IDictionary(Of String, LinkLoadResult)
```

Visual C++
---
```text
public:
IDictionary<String^, LinkLoadResult^>^ GetNestedLinkLoadResults()
```

# ### Return Value
A map from nested link paths to the load results for that nested link.
For links from external servers, the "path" will be the display name of the link.
# Remarks
This function is only relevant for LinkLoadResult object for RvtLinkSymbol. ie. when getIsRvtLink() is true.
# See Also
LinkLoadResult Class
Autodesk.Revit.DB Namespace